# Axis Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
CylindricalFace..::..Axis Property
CylindricalFace Class See Also
---
Axis of the surface.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public XYZ Axis { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Axis As XYZ
	Get
```

Visual C++
---
```text
public:
property XYZ^ Axis {
	XYZ^ get ();
}
```

# See Also
CylindricalFace Class
Autodesk.Revit.DB Namespace